jmetertest/jmeter.log
2019-08-31 22:04:41,648 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2019-08-31 22:04:41,658 INFO o.a.j.JMeter: Loading user properties from: D:\software\apache-jmeter-4.0\bin\user.properties
2019-08-31 22:04:41,658 INFO o.a.j.JMeter: Loading system properties from: D:\software\apache-jmeter-4.0\bin\system.properties
2019-08-31 22:04:41,663 INFO o.a.j.JMeter: Copyright (c) 1998-2018 The Apache Software Foundation
2019-08-31 22:04:41,663 INFO o.a.j.JMeter: Version 4.0 r1823414
2019-08-31 22:04:41,663 INFO o.a.j.JMeter: java.version=1.8.0_221
2019-08-31 22:04:41,663 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2019-08-31 22:04:41,663 INFO o.a.j.JMeter: os.name=Windows 10
2019-08-31 22:04:41,663 INFO o.a.j.JMeter: os.arch=amd64
2019-08-31 22:04:41,676 INFO o.a.j.JMeter: os.version=10.0
2019-08-31 22:04:41,676 INFO o.a.j.JMeter: file.encoding=GBK
2019-08-31 22:04:41,677 INFO o.a.j.JMeter: Max memory     =1073741824
2019-08-31 22:04:41,677 INFO o.a.j.JMeter: Available Processors =4
2019-08-31 22:04:41,685 INFO o.a.j.JMeter: Default Locale=English (EN)
2019-08-31 22:04:41,686 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2019-08-31 22:04:41,686 INFO o.a.j.JMeter: JMeterHome=D:\software\apache-jmeter-4.0
2019-08-31 22:04:41,687 INFO o.a.j.JMeter: user.dir  =E:\test\jmetertest
2019-08-31 22:04:41,687 INFO o.a.j.JMeter: PWD       =E:\test\jmetertest
2019-08-31 22:04:50,716 INFO o.a.j.JMeter: IP: 169.254.49.236 Name: DESKTOP-0F4342J FullName: DESKTOP-0F4342J
2019-08-31 22:04:50,724 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'E:\test\jmetertest\.\test'
2019-08-31 22:04:50,730 INFO o.a.j.s.FileServer: Default base='E:\test\jmetertest'
2019-08-31 22:04:50,867 INFO o.a.j.s.FileServer: Set new base='E:\test\jmetertest'
2019-08-31 22:04:51,165 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2019-08-31 22:04:51,222 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2019-08-31 22:04:51,226 INFO o.a.j.s.SaveService: Using SaveService properties version 4.0
2019-08-31 22:04:51,230 INFO o.a.j.s.SaveService: Loading file: 02Test Plan.jmx
2019-08-31 22:04:51,400 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2019-08-31 22:04:51,421 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-08-31 22:04:51,421 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-08-31 22:04:51,421 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-08-31 22:04:51,421 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2019-08-31 22:04:51,421 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2019-08-31 22:04:51,421 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2019-08-31 22:04:51,436 INFO o.a.j.JMeter: Creating summariser <summary>
2019-08-31 22:04:51,440 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2019-08-31 22:04:51,440 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: test.jtl
2019-08-31 22:04:51,440 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: D:\software\apache-jmeter-4.0\bin\reportgenerator.properties
2019-08-31 22:04:51,448 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2019-08-31 22:04:51,478 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2019-08-31 22:04:51,480 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2019-08-31 22:04:51,480 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2019-08-31 22:04:51,480 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2019-08-31 22:04:51,480 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2019-08-31 22:04:51,480 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2019-08-31 22:04:51,480 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2019-08-31 22:04:51,480 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2019-08-31 22:04:51,481 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2019-08-31 22:04:51,507 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-08-31 22:04:51,507 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2019-08-31 22:04:51,507 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2019-08-31 22:04:51,507 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2019-08-31 22:04:51,507 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2019-08-31 22:04:51,507 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-08-31 22:04:51,507 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-08-31 22:04:51,508 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-08-31 22:04:51,508 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-08-31 22:04:51,509 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2019-08-31 22:04:51,509 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2019-08-31 22:04:51,509 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2019-08-31 22:04:51,513 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2019-08-31 22:04:51,515 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-08-31 22:04:51,515 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-08-31 22:04:51,520 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2019-08-31 22:04:51,520 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2019-08-31 22:04:52,243 INFO o.a.j.JMeter: Running test (1567260292243)
2019-08-31 22:04:52,307 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : demo1
2019-08-31 22:04:52,307 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group demo1.
2019-08-31 22:04:52,307 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-08-31 22:04:52,308 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 perThread=1000.0 delayedStart=false
2019-08-31 22:04:52,317 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2019-08-31 22:04:52,317 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 2 : demo2参数化
2019-08-31 22:04:52,317 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group demo2参数化.
2019-08-31 22:04:52,317 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-08-31 22:04:52,317 INFO o.a.j.t.ThreadGroup: Starting thread group... number=2 threads=1 ramp-up=1 perThread=1000.0 delayedStart=false
2019-08-31 22:04:52,322 INFO o.a.j.t.JMeterThread: Thread started: demo1 1-1
2019-08-31 22:04:52,347 INFO o.a.j.t.ThreadGroup: Started thread group number 2
2019-08-31 22:04:52,347 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2019-08-31 22:04:52,348 INFO o.a.j.t.JMeterThread: Thread started: demo2参数化 2-1
2019-08-31 22:04:52,349 INFO o.a.j.t.JMeterThread: Thread is done: demo2参数化 2-1
2019-08-31 22:04:52,349 INFO o.a.j.t.JMeterThread: Thread finished: demo2参数化 2-1
2019-08-31 22:04:52,389 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = DESKTOP-0F4342J
2019-08-31 22:04:52,409 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2019-08-31 22:04:52,444 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2019-08-31 22:04:52,445 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2019-08-31 22:04:52,445 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2019-08-31 22:04:52,445 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2019-08-31 22:04:53,021 INFO o.a.j.t.JMeterThread: Thread is done: demo1 1-1
2019-08-31 22:04:53,021 INFO o.a.j.t.JMeterThread: Thread finished: demo1 1-1
2019-08-31 22:04:53,023 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2019-08-31 22:04:53,027 INFO o.a.j.r.Summariser: summary =      2 in 00:00:01 =    2.6/s Avg:   240 Min:    96 Max:   384 Err:     1 (50.00%)
2019-08-31 22:04:53,030 INFO o.a.j.JMeter: Generating Dashboard
2019-08-31 22:04:53,030 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2019-08-31 22:04:53,064 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2019-08-31 22:04:53,353 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2019-08-31 22:04:53,353 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2019-08-31 22:04:53,356 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2019-08-31 22:04:53,356 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2019-08-31 22:04:53,376 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2019-08-31 22:04:53,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2019-08-31 22:04:53,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2019-08-31 22:04:53,394 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2019-08-31 22:04:53,414 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2019-08-31 22:04:53,414 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2019-08-31 22:04:53,414 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2019-08-31 22:04:53,414 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2019-08-31 22:04:53,416 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2019-08-31 22:04:53,416 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 14 samples
2019-08-31 22:04:53,416 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2019-08-31 22:04:53,416 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2019-08-31 22:04:53,416 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2019-08-31 22:04:53,416 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2019-08-31 22:04:53,416 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2019-08-31 22:04:53,417 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2019-08-31 22:04:53,417 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2019-08-31 22:04:53,417 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2019-08-31 22:04:53,417 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2019-08-31 22:04:53,417 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 28 samples
2019-08-31 22:04:53,417 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 6 samples
2019-08-31 22:04:53,417 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 2 samples
2019-08-31 22:04:53,417 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 2 samples produced in 328ms on channel 0
2019-08-31 22:04:53,418 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2019-08-31 22:04:53,428 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: E:\test\jmetertest\.\test
2019-08-31 22:04:53,574 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: E:\test\jmetertest\.\test, creating folder structure
2019-08-31 22:04:54,721 INFO o.a.j.JMeter: Dashboard generated